---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView
source: html/fba57dd8-45b1-f649-0c49-b553fb3b9e13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView Property

You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsAlreadyDisplacedInView { get; }
```